BitBoxSwiss/bitbox02-firmware/external/samd51a-ds/include/component/can.h
#define CAN_TDCR_TDCF_Pos           0            /**< \brief (CAN_TDCR) Transmitter Delay Compensation Filter Length */
#define CAN_TDCR_TDCF_Msk           (0x7Fu << CAN_TDCR_TDCF_Pos)
#define CAN_TDCR_TDCF(value)        (CAN_TDCR_TDCF_Msk & ((value) << CAN_TDCR_TDCF_Pos))
#define CAN_TDCR_TDCO_Pos           8            /**< \brief (CAN_TDCR) Transmitter Delay Compensation Offset */
#define CAN_TDCR_TDCO_Msk           (0x7Fu << CAN_TDCR_TDCO_Pos)
#define CAN_TDCR_TDCO(value)        (CAN_TDCR_TDCO_Msk & ((value) << CAN_TDCR_TDCO_Pos))
#define CAN_TDCR_MASK               0x00007F7Fu  /**< \brief (CAN_TDCR) MASK Register */

/* -------- CAN_IR : (CAN Offset: 0x50) (R/W 32) Interrupt -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t RF0N: 1;          /*!< bit:      0  Rx FIFO 0 New Message              */
        uint32_t RF0W: 1;          /*!< bit:      1  Rx FIFO 0 Watermark Reached        */
        uint32_t RF0F: 1;          /*!< bit:      2  Rx FIFO 0 Full                     */
        uint32_t RF0L: 1;          /*!< bit:      3  Rx FIFO 0 Message Lost             */
        uint32_t RF1N: 1;          /*!< bit:      4  Rx FIFO 1 New Message              */
        uint32_t RF1W: 1;          /*!< bit:      5  Rx FIFO 1 Watermark Reached        */
        uint32_t RF1F: 1;          /*!< bit:      6  Rx FIFO 1 FIFO Full                */
        uint32_t RF1L: 1;          /*!< bit:      7  Rx FIFO 1 Message Lost             */
        uint32_t HPM: 1;           /*!< bit:      8  High Priority Message              */
        uint32_t TC: 1;            /*!< bit:      9  Timestamp Completed                */
        uint32_t TCF: 1;           /*!< bit:     10  Transmission Cancellation Finished */
        uint32_t TFE: 1;           /*!< bit:     11  Tx FIFO Empty                      */
        uint32_t TEFN: 1;          /*!< bit:     12  Tx Event FIFO New Entry            */
        uint32_t TEFW: 1;          /*!< bit:     13  Tx Event FIFO Watermark Reached    */
        uint32_t TEFF: 1;          /*!< bit:     14  Tx Event FIFO Full                 */
        uint32_t TEFL: 1;          /*!< bit:     15  Tx Event FIFO Element Lost         */
        uint32_t TSW: 1;           /*!< bit:     16  Timestamp Wraparound               */
        uint32_t MRAF: 1;          /*!< bit:     17  Message RAM Access Failure         */
        uint32_t TOO: 1;           /*!< bit:     18  Timeout Occurred                   */
        uint32_t DRX: 1;           /*!< bit:     19  Message stored to Dedicated Rx Buffer */
        uint32_t BEC: 1;           /*!< bit:     20  Bit Error Corrected                */
        uint32_t BEU: 1;           /*!< bit:     21  Bit Error Uncorrected              */
        uint32_t ELO: 1;           /*!< bit:     22  Error Logging Overflow             */
        uint32_t EP: 1;            /*!< bit:     23  Error Passive                      */
        uint32_t EW: 1;            /*!< bit:     24  Warning Status                     */
        uint32_t BO: 1;            /*!< bit:     25  Bus_Off Status                     */
        uint32_t WDI: 1;           /*!< bit:     26  Watchdog Interrupt                 */
        uint32_t PEA: 1;           /*!< bit:     27  Protocol Error in Arbitration Phase */
        uint32_t PED: 1;           /*!< bit:     28  Protocol Error in Data Phase       */
        uint32_t ARA: 1;           /*!< bit:     29  Access to Reserved Address         */
        uint32_t : 2;              /*!< bit: 30..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} CAN_IR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CAN_IR_OFFSET               0x50         /**< \brief (CAN_IR offset) Interrupt */
#define CAN_IR_RESETVALUE           0x00000000u  /**< \brief (CAN_IR reset_value) Interrupt */

#define CAN_IR_RF0N_Pos             0            /**< \brief (CAN_IR) Rx FIFO 0 New Message */
#define CAN_IR_RF0N                 (0x1u << CAN_IR_RF0N_Pos)
#define CAN_IR_RF0W_Pos             1            /**< \brief (CAN_IR) Rx FIFO 0 Watermark Reached */
#define CAN_IR_RF0W                 (0x1u << CAN_IR_RF0W_Pos)
#define CAN_IR_RF0F_Pos             2            /**< \brief (CAN_IR) Rx FIFO 0 Full */
#define CAN_IR_RF0F                 (0x1u << CAN_IR_RF0F_Pos)
#define CAN_IR_RF0L_Pos             3            /**< \brief (CAN_IR) Rx FIFO 0 Message Lost */
#define CAN_IR_RF0L                 (0x1u << CAN_IR_RF0L_Pos)
#define CAN_IR_RF1N_Pos             4            /**< \brief (CAN_IR) Rx FIFO 1 New Message */
#define CAN_IR_RF1N                 (0x1u << CAN_IR_RF1N_Pos)
#define CAN_IR_RF1W_Pos             5            /**< \brief (CAN_IR) Rx FIFO 1 Watermark Reached */
#define CAN_IR_RF1W                 (0x1u << CAN_IR_RF1W_Pos)
#define CAN_IR_RF1F_Pos             6            /**< \brief (CAN_IR) Rx FIFO 1 FIFO Full */
#define CAN_IR_RF1F                 (0x1u << CAN_IR_RF1F_Pos)
#define CAN_IR_RF1L_Pos             7            /**< \brief (CAN_IR) Rx FIFO 1 Message Lost */
#define CAN_IR_RF1L                 (0x1u << CAN_IR_RF1L_Pos)
#define CAN_IR_HPM_Pos              8            /**< \brief (CAN_IR) High Priority Message */
#define CAN_IR_HPM                  (0x1u << CAN_IR_HPM_Pos)
#define CAN_IR_TC_Pos               9            /**< \brief (CAN_IR) Timestamp Completed */
#define CAN_IR_TC                   (0x1u << CAN_IR_TC_Pos)
#define CAN_IR_TCF_Pos              10           /**< \brief (CAN_IR) Transmission Cancellation Finished */
#define CAN_IR_TCF                  (0x1u << CAN_IR_TCF_Pos)
#define CAN_IR_TFE_Pos              11           /**< \brief (CAN_IR) Tx FIFO Empty */
#define CAN_IR_TFE                  (0x1u << CAN_IR_TFE_Pos)
#define CAN_IR_TEFN_Pos             12           /**< \brief (CAN_IR) Tx Event FIFO New Entry */
#define CAN_IR_TEFN                 (0x1u << CAN_IR_TEFN_Pos)
#define CAN_IR_TEFW_Pos             13           /**< \brief (CAN_IR) Tx Event FIFO Watermark Reached */
#define CAN_IR_TEFW                 (0x1u << CAN_IR_TEFW_Pos)
#define CAN_IR_TEFF_Pos             14           /**< \brief (CAN_IR) Tx Event FIFO Full */
#define CAN_IR_TEFF                 (0x1u << CAN_IR_TEFF_Pos)
#define CAN_IR_TEFL_Pos             15           /**< \brief (CAN_IR) Tx Event FIFO Element Lost */
#define CAN_IR_TEFL                 (0x1u << CAN_IR_TEFL_Pos)
#define CAN_IR_TSW_Pos              16           /**< \brief (CAN_IR) Timestamp Wraparound */
#define CAN_IR_TSW                  (0x1u << CAN_IR_TSW_Pos)
#define CAN_IR_MRAF_Pos             17           /**< \brief (CAN_IR) Message RAM Access Failure */
#define CAN_IR_MRAF                 (0x1u << CAN_IR_MRAF_Pos)
#define CAN_IR_TOO_Pos              18           /**< \brief (CAN_IR) Timeout Occurred */
#define CAN_IR_TOO                  (0x1u << CAN_IR_TOO_Pos)
#define CAN_IR_DRX_Pos              19           /**< \brief (CAN_IR) Message stored to Dedicated Rx Buffer */
#define CAN_IR_DRX                  (0x1u << CAN_IR_DRX_Pos)
#define CAN_IR_BEC_Pos              20           /**< \brief (CAN_IR) Bit Error Corrected */
#define CAN_IR_BEC                  (0x1u << CAN_IR_BEC_Pos)
#define CAN_IR_BEU_Pos              21           /**< \brief (CAN_IR) Bit Error Uncorrected */
#define CAN_IR_BEU                  (0x1u << CAN_IR_BEU_Pos)
#define CAN_IR_ELO_Pos              22           /**< \brief (CAN_IR) Error Logging Overflow */
#define CAN_IR_ELO                  (0x1u << CAN_IR_ELO_Pos)
#define CAN_IR_EP_Pos               23           /**< \brief (CAN_IR) Error Passive */
#define CAN_IR_EP                   (0x1u << CAN_IR_EP_Pos)
#define CAN_IR_EW_Pos               24           /**< \brief (CAN_IR) Warning Status */
#define CAN_IR_EW                   (0x1u << CAN_IR_EW_Pos)
#define CAN_IR_BO_Pos               25           /**< \brief (CAN_IR) Bus_Off Status */
#define CAN_IR_BO                   (0x1u << CAN_IR_BO_Pos)
#define CAN_IR_WDI_Pos              26           /**< \brief (CAN_IR) Watchdog Interrupt */
#define CAN_IR_WDI                  (0x1u << CAN_IR_WDI_Pos)
#define CAN_IR_PEA_Pos              27           /**< \brief (CAN_IR) Protocol Error in Arbitration Phase */
#define CAN_IR_PEA                  (0x1u << CAN_IR_PEA_Pos)
#define CAN_IR_PED_Pos              28           /**< \brief (CAN_IR) Protocol Error in Data Phase */
#define CAN_IR_PED                  (0x1u << CAN_IR_PED_Pos)
#define CAN_IR_ARA_Pos              29           /**< \brief (CAN_IR) Access to Reserved Address */
#define CAN_IR_ARA                  (0x1u << CAN_IR_ARA_Pos)
#define CAN_IR_MASK                 0x3FFFFFFFu  /**< \brief (CAN_IR) MASK Register */

/* -------- CAN_IE : (CAN Offset: 0x54) (R/W 32) Interrupt Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t RF0NE: 1;         /*!< bit:      0  Rx FIFO 0 New Message Interrupt Enable */
    uint32_t RF0WE:
        1;         /*!< bit:      1  Rx FIFO 0 Watermark Reached Interrupt Enable */
        uint32_t RF0FE: 1;         /*!< bit:      2  Rx FIFO 0 Full Interrupt Enable    */
        uint32_t RF0LE: 1;         /*!< bit:      3  Rx FIFO 0 Message Lost Interrupt Enable */
        uint32_t RF1NE: 1;         /*!< bit:      4  Rx FIFO 1 New Message Interrupt Enable */
    uint32_t RF1WE:
        1;         /*!< bit:      5  Rx FIFO 1 Watermark Reached Interrupt Enable */
        uint32_t RF1FE: 1;         /*!< bit:      6  Rx FIFO 1 FIFO Full Interrupt Enable */
        uint32_t RF1LE: 1;         /*!< bit:      7  Rx FIFO 1 Message Lost Interrupt Enable */
        uint32_t HPME: 1;          /*!< bit:      8  High Priority Message Interrupt Enable */
        uint32_t TCE: 1;           /*!< bit:      9  Timestamp Completed Interrupt Enable */
    uint32_t TCFE:
        1;          /*!< bit:     10  Transmission Cancellation Finished Interrupt Enable */
        uint32_t TFEE: 1;          /*!< bit:     11  Tx FIFO Empty Interrupt Enable     */
        uint32_t TEFNE: 1;         /*!< bit:     12  Tx Event FIFO New Entry Interrupt Enable */
    uint32_t TEFWE:
        1;         /*!< bit:     13  Tx Event FIFO Watermark Reached Interrupt Enable */
        uint32_t TEFFE: 1;         /*!< bit:     14  Tx Event FIFO Full Interrupt Enable */
    uint32_t TEFLE:
        1;         /*!< bit:     15  Tx Event FIFO Element Lost Interrupt Enable */
        uint32_t TSWE: 1;          /*!< bit:     16  Timestamp Wraparound Interrupt Enable */
    uint32_t MRAFE:
        1;         /*!< bit:     17  Message RAM Access Failure Interrupt Enable */
        uint32_t TOOE: 1;          /*!< bit:     18  Timeout Occurred Interrupt Enable  */
    uint32_t DRXE:
        1;          /*!< bit:     19  Message stored to Dedicated Rx Buffer Interrupt Enable */
        uint32_t BECE: 1;          /*!< bit:     20  Bit Error Corrected Interrupt Enable */
        uint32_t BEUE: 1;          /*!< bit:     21  Bit Error Uncorrected Interrupt Enable */
        uint32_t ELOE: 1;          /*!< bit:     22  Error Logging Overflow Interrupt Enable */
        uint32_t EPE: 1;           /*!< bit:     23  Error Passive Interrupt Enable     */
        uint32_t EWE: 1;           /*!< bit:     24  Warning Status Interrupt Enable    */
        uint32_t BOE: 1;           /*!< bit:     25  Bus_Off Status Interrupt Enable    */
        uint32_t WDIE: 1;          /*!< bit:     26  Watchdog Interrupt Interrupt Enable */
        uint32_t PEAE: 1;          /*!< bit:     27  Protocol Error in Arbitration Phase Enable */
        uint32_t PEDE: 1;          /*!< bit:     28  Protocol Error in Data Phase Enable */
        uint32_t ARAE: 1;          /*!< bit:     29  Access to Reserved Address Enable  */
        uint32_t : 2;              /*!< bit: 30..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} CAN_IE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CAN_IE_OFFSET               0x54         /**< \brief (CAN_IE offset) Interrupt Enable */
#define CAN_IE_RESETVALUE           0x00000000u  /**< \brief (CAN_IE reset_value) Interrupt Enable */

