BitBoxSwiss/bitbox02-firmware/external/samd51a-ds/include/component/can.h
#define CAN_XIDAM_OFFSET            0x90         /**< \brief (CAN_XIDAM offset) Extended ID AND Mask */
#define CAN_XIDAM_RESETVALUE        0x1FFFFFFFu  /**< \brief (CAN_XIDAM reset_value) Extended ID AND Mask */

#define CAN_XIDAM_EIDM_Pos          0            /**< \brief (CAN_XIDAM) Extended ID Mask */
#define CAN_XIDAM_EIDM_Msk          (0x1FFFFFFFu << CAN_XIDAM_EIDM_Pos)
#define CAN_XIDAM_EIDM(value)       (CAN_XIDAM_EIDM_Msk & ((value) << CAN_XIDAM_EIDM_Pos))
#define CAN_XIDAM_MASK              0x1FFFFFFFu  /**< \brief (CAN_XIDAM) MASK Register */

/* -------- CAN_HPMS : (CAN Offset: 0x94) (R/  32) High Priority Message Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t BIDX: 6;          /*!< bit:  0.. 5  Buffer Index                       */
        uint32_t MSI: 2;           /*!< bit:  6.. 7  Message Storage Indicator          */
        uint32_t FIDX: 7;          /*!< bit:  8..14  Filter Index                       */
        uint32_t FLST: 1;          /*!< bit:     15  Filter List                        */
        uint32_t : 16;             /*!< bit: 16..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} CAN_HPMS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CAN_HPMS_OFFSET             0x94         /**< \brief (CAN_HPMS offset) High Priority Message Status */
#define CAN_HPMS_RESETVALUE         0x00000000u  /**< \brief (CAN_HPMS reset_value) High Priority Message Status */

#define CAN_HPMS_BIDX_Pos           0            /**< \brief (CAN_HPMS) Buffer Index */
#define CAN_HPMS_BIDX_Msk           (0x3Fu << CAN_HPMS_BIDX_Pos)
#define CAN_HPMS_BIDX(value)        (CAN_HPMS_BIDX_Msk & ((value) << CAN_HPMS_BIDX_Pos))
#define CAN_HPMS_MSI_Pos            6            /**< \brief (CAN_HPMS) Message Storage Indicator */
#define CAN_HPMS_MSI_Msk            (0x3u << CAN_HPMS_MSI_Pos)
#define CAN_HPMS_MSI(value)         (CAN_HPMS_MSI_Msk & ((value) << CAN_HPMS_MSI_Pos))
#define   CAN_HPMS_MSI_NONE_Val           0x0u   /**< \brief (CAN_HPMS) No FIFO selected */
#define   CAN_HPMS_MSI_LOST_Val           0x1u   /**< \brief (CAN_HPMS) FIFO message lost */
#define   CAN_HPMS_MSI_FIFO0_Val          0x2u   /**< \brief (CAN_HPMS) Message stored in FIFO 0 */
#define   CAN_HPMS_MSI_FIFO1_Val          0x3u   /**< \brief (CAN_HPMS) Message stored in FIFO 1 */
#define CAN_HPMS_MSI_NONE           (CAN_HPMS_MSI_NONE_Val         << CAN_HPMS_MSI_Pos)
#define CAN_HPMS_MSI_LOST           (CAN_HPMS_MSI_LOST_Val         << CAN_HPMS_MSI_Pos)
#define CAN_HPMS_MSI_FIFO0          (CAN_HPMS_MSI_FIFO0_Val        << CAN_HPMS_MSI_Pos)
#define CAN_HPMS_MSI_FIFO1          (CAN_HPMS_MSI_FIFO1_Val        << CAN_HPMS_MSI_Pos)
#define CAN_HPMS_FIDX_Pos           8            /**< \brief (CAN_HPMS) Filter Index */
#define CAN_HPMS_FIDX_Msk           (0x7Fu << CAN_HPMS_FIDX_Pos)
#define CAN_HPMS_FIDX(value)        (CAN_HPMS_FIDX_Msk & ((value) << CAN_HPMS_FIDX_Pos))
#define CAN_HPMS_FLST_Pos           15           /**< \brief (CAN_HPMS) Filter List */
#define CAN_HPMS_FLST               (0x1u << CAN_HPMS_FLST_Pos)
#define CAN_HPMS_MASK               0x0000FFFFu  /**< \brief (CAN_HPMS) MASK Register */

/* -------- CAN_NDAT1 : (CAN Offset: 0x98) (R/W 32) New Data 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t ND0: 1;           /*!< bit:      0  New Data 0                         */
        uint32_t ND1: 1;           /*!< bit:      1  New Data 1                         */
        uint32_t ND2: 1;           /*!< bit:      2  New Data 2                         */
        uint32_t ND3: 1;           /*!< bit:      3  New Data 3                         */
        uint32_t ND4: 1;           /*!< bit:      4  New Data 4                         */
        uint32_t ND5: 1;           /*!< bit:      5  New Data 5                         */
        uint32_t ND6: 1;           /*!< bit:      6  New Data 6                         */
        uint32_t ND7: 1;           /*!< bit:      7  New Data 7                         */
        uint32_t ND8: 1;           /*!< bit:      8  New Data 8                         */
        uint32_t ND9: 1;           /*!< bit:      9  New Data 9                         */
        uint32_t ND10: 1;          /*!< bit:     10  New Data 10                        */
        uint32_t ND11: 1;          /*!< bit:     11  New Data 11                        */
        uint32_t ND12: 1;          /*!< bit:     12  New Data 12                        */
        uint32_t ND13: 1;          /*!< bit:     13  New Data 13                        */
        uint32_t ND14: 1;          /*!< bit:     14  New Data 14                        */
        uint32_t ND15: 1;          /*!< bit:     15  New Data 15                        */
        uint32_t ND16: 1;          /*!< bit:     16  New Data 16                        */
        uint32_t ND17: 1;          /*!< bit:     17  New Data 17                        */
        uint32_t ND18: 1;          /*!< bit:     18  New Data 18                        */
        uint32_t ND19: 1;          /*!< bit:     19  New Data 19                        */
        uint32_t ND20: 1;          /*!< bit:     20  New Data 20                        */
        uint32_t ND21: 1;          /*!< bit:     21  New Data 21                        */
        uint32_t ND22: 1;          /*!< bit:     22  New Data 22                        */
        uint32_t ND23: 1;          /*!< bit:     23  New Data 23                        */
        uint32_t ND24: 1;          /*!< bit:     24  New Data 24                        */
        uint32_t ND25: 1;          /*!< bit:     25  New Data 25                        */
        uint32_t ND26: 1;          /*!< bit:     26  New Data 26                        */
        uint32_t ND27: 1;          /*!< bit:     27  New Data 27                        */
        uint32_t ND28: 1;          /*!< bit:     28  New Data 28                        */
        uint32_t ND29: 1;          /*!< bit:     29  New Data 29                        */
        uint32_t ND30: 1;          /*!< bit:     30  New Data 30                        */
        uint32_t ND31: 1;          /*!< bit:     31  New Data 31                        */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} CAN_NDAT1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CAN_NDAT1_OFFSET            0x98         /**< \brief (CAN_NDAT1 offset) New Data 1 */
#define CAN_NDAT1_RESETVALUE        0x00000000u  /**< \brief (CAN_NDAT1 reset_value) New Data 1 */

#define CAN_NDAT1_ND0_Pos           0            /**< \brief (CAN_NDAT1) New Data 0 */
#define CAN_NDAT1_ND0               (0x1u << CAN_NDAT1_ND0_Pos)
#define CAN_NDAT1_ND1_Pos           1            /**< \brief (CAN_NDAT1) New Data 1 */
#define CAN_NDAT1_ND1               (0x1u << CAN_NDAT1_ND1_Pos)
#define CAN_NDAT1_ND2_Pos           2            /**< \brief (CAN_NDAT1) New Data 2 */
#define CAN_NDAT1_ND2               (0x1u << CAN_NDAT1_ND2_Pos)
#define CAN_NDAT1_ND3_Pos           3            /**< \brief (CAN_NDAT1) New Data 3 */
#define CAN_NDAT1_ND3               (0x1u << CAN_NDAT1_ND3_Pos)
#define CAN_NDAT1_ND4_Pos           4            /**< \brief (CAN_NDAT1) New Data 4 */
#define CAN_NDAT1_ND4               (0x1u << CAN_NDAT1_ND4_Pos)
#define CAN_NDAT1_ND5_Pos           5            /**< \brief (CAN_NDAT1) New Data 5 */
#define CAN_NDAT1_ND5               (0x1u << CAN_NDAT1_ND5_Pos)
#define CAN_NDAT1_ND6_Pos           6            /**< \brief (CAN_NDAT1) New Data 6 */
#define CAN_NDAT1_ND6               (0x1u << CAN_NDAT1_ND6_Pos)
#define CAN_NDAT1_ND7_Pos           7            /**< \brief (CAN_NDAT1) New Data 7 */
#define CAN_NDAT1_ND7               (0x1u << CAN_NDAT1_ND7_Pos)
#define CAN_NDAT1_ND8_Pos           8            /**< \brief (CAN_NDAT1) New Data 8 */
#define CAN_NDAT1_ND8               (0x1u << CAN_NDAT1_ND8_Pos)
#define CAN_NDAT1_ND9_Pos           9            /**< \brief (CAN_NDAT1) New Data 9 */
#define CAN_NDAT1_ND9               (0x1u << CAN_NDAT1_ND9_Pos)
#define CAN_NDAT1_ND10_Pos          10           /**< \brief (CAN_NDAT1) New Data 10 */
#define CAN_NDAT1_ND10              (0x1u << CAN_NDAT1_ND10_Pos)
#define CAN_NDAT1_ND11_Pos          11           /**< \brief (CAN_NDAT1) New Data 11 */
#define CAN_NDAT1_ND11              (0x1u << CAN_NDAT1_ND11_Pos)
#define CAN_NDAT1_ND12_Pos          12           /**< \brief (CAN_NDAT1) New Data 12 */
#define CAN_NDAT1_ND12              (0x1u << CAN_NDAT1_ND12_Pos)
#define CAN_NDAT1_ND13_Pos          13           /**< \brief (CAN_NDAT1) New Data 13 */
#define CAN_NDAT1_ND13              (0x1u << CAN_NDAT1_ND13_Pos)
#define CAN_NDAT1_ND14_Pos          14           /**< \brief (CAN_NDAT1) New Data 14 */
#define CAN_NDAT1_ND14              (0x1u << CAN_NDAT1_ND14_Pos)
#define CAN_NDAT1_ND15_Pos          15           /**< \brief (CAN_NDAT1) New Data 15 */
#define CAN_NDAT1_ND15              (0x1u << CAN_NDAT1_ND15_Pos)
#define CAN_NDAT1_ND16_Pos          16           /**< \brief (CAN_NDAT1) New Data 16 */
#define CAN_NDAT1_ND16              (0x1u << CAN_NDAT1_ND16_Pos)
#define CAN_NDAT1_ND17_Pos          17           /**< \brief (CAN_NDAT1) New Data 17 */
#define CAN_NDAT1_ND17              (0x1u << CAN_NDAT1_ND17_Pos)
#define CAN_NDAT1_ND18_Pos          18           /**< \brief (CAN_NDAT1) New Data 18 */
#define CAN_NDAT1_ND18              (0x1u << CAN_NDAT1_ND18_Pos)
#define CAN_NDAT1_ND19_Pos          19           /**< \brief (CAN_NDAT1) New Data 19 */
#define CAN_NDAT1_ND19              (0x1u << CAN_NDAT1_ND19_Pos)
#define CAN_NDAT1_ND20_Pos          20           /**< \brief (CAN_NDAT1) New Data 20 */
#define CAN_NDAT1_ND20              (0x1u << CAN_NDAT1_ND20_Pos)
#define CAN_NDAT1_ND21_Pos          21           /**< \brief (CAN_NDAT1) New Data 21 */
#define CAN_NDAT1_ND21              (0x1u << CAN_NDAT1_ND21_Pos)
#define CAN_NDAT1_ND22_Pos          22           /**< \brief (CAN_NDAT1) New Data 22 */
#define CAN_NDAT1_ND22              (0x1u << CAN_NDAT1_ND22_Pos)
#define CAN_NDAT1_ND23_Pos          23           /**< \brief (CAN_NDAT1) New Data 23 */
#define CAN_NDAT1_ND23              (0x1u << CAN_NDAT1_ND23_Pos)
#define CAN_NDAT1_ND24_Pos          24           /**< \brief (CAN_NDAT1) New Data 24 */
#define CAN_NDAT1_ND24              (0x1u << CAN_NDAT1_ND24_Pos)
#define CAN_NDAT1_ND25_Pos          25           /**< \brief (CAN_NDAT1) New Data 25 */
#define CAN_NDAT1_ND25              (0x1u << CAN_NDAT1_ND25_Pos)
#define CAN_NDAT1_ND26_Pos          26           /**< \brief (CAN_NDAT1) New Data 26 */
#define CAN_NDAT1_ND26              (0x1u << CAN_NDAT1_ND26_Pos)
#define CAN_NDAT1_ND27_Pos          27           /**< \brief (CAN_NDAT1) New Data 27 */
#define CAN_NDAT1_ND27              (0x1u << CAN_NDAT1_ND27_Pos)
#define CAN_NDAT1_ND28_Pos          28           /**< \brief (CAN_NDAT1) New Data 28 */
#define CAN_NDAT1_ND28              (0x1u << CAN_NDAT1_ND28_Pos)
#define CAN_NDAT1_ND29_Pos          29           /**< \brief (CAN_NDAT1) New Data 29 */
#define CAN_NDAT1_ND29              (0x1u << CAN_NDAT1_ND29_Pos)
#define CAN_NDAT1_ND30_Pos          30           /**< \brief (CAN_NDAT1) New Data 30 */
#define CAN_NDAT1_ND30              (0x1u << CAN_NDAT1_ND30_Pos)
#define CAN_NDAT1_ND31_Pos          31           /**< \brief (CAN_NDAT1) New Data 31 */
#define CAN_NDAT1_ND31              (0x1u << CAN_NDAT1_ND31_Pos)
#define CAN_NDAT1_MASK              0xFFFFFFFFu  /**< \brief (CAN_NDAT1) MASK Register */

/* -------- CAN_NDAT2 : (CAN Offset: 0x9C) (R/W 32) New Data 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t ND32: 1;          /*!< bit:      0  New Data 32                        */
        uint32_t ND33: 1;          /*!< bit:      1  New Data 33                        */
        uint32_t ND34: 1;          /*!< bit:      2  New Data 34                        */
        uint32_t ND35: 1;          /*!< bit:      3  New Data 35                        */
        uint32_t ND36: 1;          /*!< bit:      4  New Data 36                        */
        uint32_t ND37: 1;          /*!< bit:      5  New Data 37                        */
        uint32_t ND38: 1;          /*!< bit:      6  New Data 38                        */
        uint32_t ND39: 1;          /*!< bit:      7  New Data 39                        */
        uint32_t ND40: 1;          /*!< bit:      8  New Data 40                        */
        uint32_t ND41: 1;          /*!< bit:      9  New Data 41                        */
        uint32_t ND42: 1;          /*!< bit:     10  New Data 42                        */
        uint32_t ND43: 1;          /*!< bit:     11  New Data 43                        */
        uint32_t ND44: 1;          /*!< bit:     12  New Data 44                        */
        uint32_t ND45: 1;          /*!< bit:     13  New Data 45                        */
        uint32_t ND46: 1;          /*!< bit:     14  New Data 46                        */
        uint32_t ND47: 1;          /*!< bit:     15  New Data 47                        */
        uint32_t ND48: 1;          /*!< bit:     16  New Data 48                        */
        uint32_t ND49: 1;          /*!< bit:     17  New Data 49                        */
        uint32_t ND50: 1;          /*!< bit:     18  New Data 50                        */
        uint32_t ND51: 1;          /*!< bit:     19  New Data 51                        */
        uint32_t ND52: 1;          /*!< bit:     20  New Data 52                        */
        uint32_t ND53: 1;          /*!< bit:     21  New Data 53                        */
        uint32_t ND54: 1;          /*!< bit:     22  New Data 54                        */
        uint32_t ND55: 1;          /*!< bit:     23  New Data 55                        */
        uint32_t ND56: 1;          /*!< bit:     24  New Data 56                        */
        uint32_t ND57: 1;          /*!< bit:     25  New Data 57                        */
        uint32_t ND58: 1;          /*!< bit:     26  New Data 58                        */
        uint32_t ND59: 1;          /*!< bit:     27  New Data 59                        */
        uint32_t ND60: 1;          /*!< bit:     28  New Data 60                        */
        uint32_t ND61: 1;          /*!< bit:     29  New Data 61                        */
        uint32_t ND62: 1;          /*!< bit:     30  New Data 62                        */
        uint32_t ND63: 1;          /*!< bit:     31  New Data 63                        */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} CAN_NDAT2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

