BitBoxSwiss/bitbox02-firmware/external/samd51a-ds/include/component/can.h
#define CAN_TXBTO_OFFSET            0xD8         /**< \brief (CAN_TXBTO offset) Tx Buffer Transmission Occurred */
#define CAN_TXBTO_RESETVALUE        0x00000000u  /**< \brief (CAN_TXBTO reset_value) Tx Buffer Transmission Occurred */

#define CAN_TXBTO_TO0_Pos           0            /**< \brief (CAN_TXBTO) Transmission Occurred 0 */
#define CAN_TXBTO_TO0               (0x1u << CAN_TXBTO_TO0_Pos)
#define CAN_TXBTO_TO1_Pos           1            /**< \brief (CAN_TXBTO) Transmission Occurred 1 */
#define CAN_TXBTO_TO1               (0x1u << CAN_TXBTO_TO1_Pos)
#define CAN_TXBTO_TO2_Pos           2            /**< \brief (CAN_TXBTO) Transmission Occurred 2 */
#define CAN_TXBTO_TO2               (0x1u << CAN_TXBTO_TO2_Pos)
#define CAN_TXBTO_TO3_Pos           3            /**< \brief (CAN_TXBTO) Transmission Occurred 3 */
#define CAN_TXBTO_TO3               (0x1u << CAN_TXBTO_TO3_Pos)
#define CAN_TXBTO_TO4_Pos           4            /**< \brief (CAN_TXBTO) Transmission Occurred 4 */
#define CAN_TXBTO_TO4               (0x1u << CAN_TXBTO_TO4_Pos)
#define CAN_TXBTO_TO5_Pos           5            /**< \brief (CAN_TXBTO) Transmission Occurred 5 */
#define CAN_TXBTO_TO5               (0x1u << CAN_TXBTO_TO5_Pos)
#define CAN_TXBTO_TO6_Pos           6            /**< \brief (CAN_TXBTO) Transmission Occurred 6 */
#define CAN_TXBTO_TO6               (0x1u << CAN_TXBTO_TO6_Pos)
#define CAN_TXBTO_TO7_Pos           7            /**< \brief (CAN_TXBTO) Transmission Occurred 7 */
#define CAN_TXBTO_TO7               (0x1u << CAN_TXBTO_TO7_Pos)
#define CAN_TXBTO_TO8_Pos           8            /**< \brief (CAN_TXBTO) Transmission Occurred 8 */
#define CAN_TXBTO_TO8               (0x1u << CAN_TXBTO_TO8_Pos)
#define CAN_TXBTO_TO9_Pos           9            /**< \brief (CAN_TXBTO) Transmission Occurred 9 */
#define CAN_TXBTO_TO9               (0x1u << CAN_TXBTO_TO9_Pos)
#define CAN_TXBTO_TO10_Pos          10           /**< \brief (CAN_TXBTO) Transmission Occurred 10 */
#define CAN_TXBTO_TO10              (0x1u << CAN_TXBTO_TO10_Pos)
#define CAN_TXBTO_TO11_Pos          11           /**< \brief (CAN_TXBTO) Transmission Occurred 11 */
#define CAN_TXBTO_TO11              (0x1u << CAN_TXBTO_TO11_Pos)
#define CAN_TXBTO_TO12_Pos          12           /**< \brief (CAN_TXBTO) Transmission Occurred 12 */
#define CAN_TXBTO_TO12              (0x1u << CAN_TXBTO_TO12_Pos)
#define CAN_TXBTO_TO13_Pos          13           /**< \brief (CAN_TXBTO) Transmission Occurred 13 */
#define CAN_TXBTO_TO13              (0x1u << CAN_TXBTO_TO13_Pos)
#define CAN_TXBTO_TO14_Pos          14           /**< \brief (CAN_TXBTO) Transmission Occurred 14 */
#define CAN_TXBTO_TO14              (0x1u << CAN_TXBTO_TO14_Pos)
#define CAN_TXBTO_TO15_Pos          15           /**< \brief (CAN_TXBTO) Transmission Occurred 15 */
#define CAN_TXBTO_TO15              (0x1u << CAN_TXBTO_TO15_Pos)
#define CAN_TXBTO_TO16_Pos          16           /**< \brief (CAN_TXBTO) Transmission Occurred 16 */
#define CAN_TXBTO_TO16              (0x1u << CAN_TXBTO_TO16_Pos)
#define CAN_TXBTO_TO17_Pos          17           /**< \brief (CAN_TXBTO) Transmission Occurred 17 */
#define CAN_TXBTO_TO17              (0x1u << CAN_TXBTO_TO17_Pos)
#define CAN_TXBTO_TO18_Pos          18           /**< \brief (CAN_TXBTO) Transmission Occurred 18 */
#define CAN_TXBTO_TO18              (0x1u << CAN_TXBTO_TO18_Pos)
#define CAN_TXBTO_TO19_Pos          19           /**< \brief (CAN_TXBTO) Transmission Occurred 19 */
#define CAN_TXBTO_TO19              (0x1u << CAN_TXBTO_TO19_Pos)
#define CAN_TXBTO_TO20_Pos          20           /**< \brief (CAN_TXBTO) Transmission Occurred 20 */
#define CAN_TXBTO_TO20              (0x1u << CAN_TXBTO_TO20_Pos)
#define CAN_TXBTO_TO21_Pos          21           /**< \brief (CAN_TXBTO) Transmission Occurred 21 */
#define CAN_TXBTO_TO21              (0x1u << CAN_TXBTO_TO21_Pos)
#define CAN_TXBTO_TO22_Pos          22           /**< \brief (CAN_TXBTO) Transmission Occurred 22 */
#define CAN_TXBTO_TO22              (0x1u << CAN_TXBTO_TO22_Pos)
#define CAN_TXBTO_TO23_Pos          23           /**< \brief (CAN_TXBTO) Transmission Occurred 23 */
#define CAN_TXBTO_TO23              (0x1u << CAN_TXBTO_TO23_Pos)
#define CAN_TXBTO_TO24_Pos          24           /**< \brief (CAN_TXBTO) Transmission Occurred 24 */
#define CAN_TXBTO_TO24              (0x1u << CAN_TXBTO_TO24_Pos)
#define CAN_TXBTO_TO25_Pos          25           /**< \brief (CAN_TXBTO) Transmission Occurred 25 */
#define CAN_TXBTO_TO25              (0x1u << CAN_TXBTO_TO25_Pos)
#define CAN_TXBTO_TO26_Pos          26           /**< \brief (CAN_TXBTO) Transmission Occurred 26 */
#define CAN_TXBTO_TO26              (0x1u << CAN_TXBTO_TO26_Pos)
#define CAN_TXBTO_TO27_Pos          27           /**< \brief (CAN_TXBTO) Transmission Occurred 27 */
#define CAN_TXBTO_TO27              (0x1u << CAN_TXBTO_TO27_Pos)
#define CAN_TXBTO_TO28_Pos          28           /**< \brief (CAN_TXBTO) Transmission Occurred 28 */
#define CAN_TXBTO_TO28              (0x1u << CAN_TXBTO_TO28_Pos)
#define CAN_TXBTO_TO29_Pos          29           /**< \brief (CAN_TXBTO) Transmission Occurred 29 */
#define CAN_TXBTO_TO29              (0x1u << CAN_TXBTO_TO29_Pos)
#define CAN_TXBTO_TO30_Pos          30           /**< \brief (CAN_TXBTO) Transmission Occurred 30 */
#define CAN_TXBTO_TO30              (0x1u << CAN_TXBTO_TO30_Pos)
#define CAN_TXBTO_TO31_Pos          31           /**< \brief (CAN_TXBTO) Transmission Occurred 31 */
#define CAN_TXBTO_TO31              (0x1u << CAN_TXBTO_TO31_Pos)
#define CAN_TXBTO_MASK              0xFFFFFFFFu  /**< \brief (CAN_TXBTO) MASK Register */

/* -------- CAN_TXBCF : (CAN Offset: 0xDC) (R/  32) Tx Buffer Cancellation Finished -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t CF0: 1;           /*!< bit:      0  Tx Buffer Cancellation Finished 0  */
        uint32_t CF1: 1;           /*!< bit:      1  Tx Buffer Cancellation Finished 1  */
        uint32_t CF2: 1;           /*!< bit:      2  Tx Buffer Cancellation Finished 2  */
        uint32_t CF3: 1;           /*!< bit:      3  Tx Buffer Cancellation Finished 3  */
        uint32_t CF4: 1;           /*!< bit:      4  Tx Buffer Cancellation Finished 4  */
        uint32_t CF5: 1;           /*!< bit:      5  Tx Buffer Cancellation Finished 5  */
        uint32_t CF6: 1;           /*!< bit:      6  Tx Buffer Cancellation Finished 6  */
        uint32_t CF7: 1;           /*!< bit:      7  Tx Buffer Cancellation Finished 7  */
        uint32_t CF8: 1;           /*!< bit:      8  Tx Buffer Cancellation Finished 8  */
        uint32_t CF9: 1;           /*!< bit:      9  Tx Buffer Cancellation Finished 9  */
        uint32_t CF10: 1;          /*!< bit:     10  Tx Buffer Cancellation Finished 10 */
        uint32_t CF11: 1;          /*!< bit:     11  Tx Buffer Cancellation Finished 11 */
        uint32_t CF12: 1;          /*!< bit:     12  Tx Buffer Cancellation Finished 12 */
        uint32_t CF13: 1;          /*!< bit:     13  Tx Buffer Cancellation Finished 13 */
        uint32_t CF14: 1;          /*!< bit:     14  Tx Buffer Cancellation Finished 14 */
        uint32_t CF15: 1;          /*!< bit:     15  Tx Buffer Cancellation Finished 15 */
        uint32_t CF16: 1;          /*!< bit:     16  Tx Buffer Cancellation Finished 16 */
        uint32_t CF17: 1;          /*!< bit:     17  Tx Buffer Cancellation Finished 17 */
        uint32_t CF18: 1;          /*!< bit:     18  Tx Buffer Cancellation Finished 18 */
        uint32_t CF19: 1;          /*!< bit:     19  Tx Buffer Cancellation Finished 19 */
        uint32_t CF20: 1;          /*!< bit:     20  Tx Buffer Cancellation Finished 20 */
        uint32_t CF21: 1;          /*!< bit:     21  Tx Buffer Cancellation Finished 21 */
        uint32_t CF22: 1;          /*!< bit:     22  Tx Buffer Cancellation Finished 22 */
        uint32_t CF23: 1;          /*!< bit:     23  Tx Buffer Cancellation Finished 23 */
        uint32_t CF24: 1;          /*!< bit:     24  Tx Buffer Cancellation Finished 24 */
        uint32_t CF25: 1;          /*!< bit:     25  Tx Buffer Cancellation Finished 25 */
        uint32_t CF26: 1;          /*!< bit:     26  Tx Buffer Cancellation Finished 26 */
        uint32_t CF27: 1;          /*!< bit:     27  Tx Buffer Cancellation Finished 27 */
        uint32_t CF28: 1;          /*!< bit:     28  Tx Buffer Cancellation Finished 28 */
        uint32_t CF29: 1;          /*!< bit:     29  Tx Buffer Cancellation Finished 29 */
        uint32_t CF30: 1;          /*!< bit:     30  Tx Buffer Cancellation Finished 30 */
        uint32_t CF31: 1;          /*!< bit:     31  Tx Buffer Cancellation Finished 31 */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} CAN_TXBCF_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CAN_TXBCF_OFFSET            0xDC         /**< \brief (CAN_TXBCF offset) Tx Buffer Cancellation Finished */
#define CAN_TXBCF_RESETVALUE        0x00000000u  /**< \brief (CAN_TXBCF reset_value) Tx Buffer Cancellation Finished */

#define CAN_TXBCF_CF0_Pos           0            /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 0 */
#define CAN_TXBCF_CF0               (0x1u << CAN_TXBCF_CF0_Pos)
#define CAN_TXBCF_CF1_Pos           1            /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 1 */
#define CAN_TXBCF_CF1               (0x1u << CAN_TXBCF_CF1_Pos)
#define CAN_TXBCF_CF2_Pos           2            /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 2 */
#define CAN_TXBCF_CF2               (0x1u << CAN_TXBCF_CF2_Pos)
#define CAN_TXBCF_CF3_Pos           3            /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 3 */
#define CAN_TXBCF_CF3               (0x1u << CAN_TXBCF_CF3_Pos)
#define CAN_TXBCF_CF4_Pos           4            /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 4 */
#define CAN_TXBCF_CF4               (0x1u << CAN_TXBCF_CF4_Pos)
#define CAN_TXBCF_CF5_Pos           5            /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 5 */
#define CAN_TXBCF_CF5               (0x1u << CAN_TXBCF_CF5_Pos)
#define CAN_TXBCF_CF6_Pos           6            /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 6 */
#define CAN_TXBCF_CF6               (0x1u << CAN_TXBCF_CF6_Pos)
#define CAN_TXBCF_CF7_Pos           7            /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 7 */
#define CAN_TXBCF_CF7               (0x1u << CAN_TXBCF_CF7_Pos)
#define CAN_TXBCF_CF8_Pos           8            /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 8 */
#define CAN_TXBCF_CF8               (0x1u << CAN_TXBCF_CF8_Pos)
#define CAN_TXBCF_CF9_Pos           9            /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 9 */
#define CAN_TXBCF_CF9               (0x1u << CAN_TXBCF_CF9_Pos)
#define CAN_TXBCF_CF10_Pos          10           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 10 */
#define CAN_TXBCF_CF10              (0x1u << CAN_TXBCF_CF10_Pos)
#define CAN_TXBCF_CF11_Pos          11           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 11 */
#define CAN_TXBCF_CF11              (0x1u << CAN_TXBCF_CF11_Pos)
#define CAN_TXBCF_CF12_Pos          12           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 12 */
#define CAN_TXBCF_CF12              (0x1u << CAN_TXBCF_CF12_Pos)
#define CAN_TXBCF_CF13_Pos          13           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 13 */
#define CAN_TXBCF_CF13              (0x1u << CAN_TXBCF_CF13_Pos)
#define CAN_TXBCF_CF14_Pos          14           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 14 */
#define CAN_TXBCF_CF14              (0x1u << CAN_TXBCF_CF14_Pos)
#define CAN_TXBCF_CF15_Pos          15           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 15 */
#define CAN_TXBCF_CF15              (0x1u << CAN_TXBCF_CF15_Pos)
#define CAN_TXBCF_CF16_Pos          16           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 16 */
#define CAN_TXBCF_CF16              (0x1u << CAN_TXBCF_CF16_Pos)
#define CAN_TXBCF_CF17_Pos          17           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 17 */
#define CAN_TXBCF_CF17              (0x1u << CAN_TXBCF_CF17_Pos)
#define CAN_TXBCF_CF18_Pos          18           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 18 */
#define CAN_TXBCF_CF18              (0x1u << CAN_TXBCF_CF18_Pos)
#define CAN_TXBCF_CF19_Pos          19           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 19 */
#define CAN_TXBCF_CF19              (0x1u << CAN_TXBCF_CF19_Pos)
#define CAN_TXBCF_CF20_Pos          20           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 20 */
#define CAN_TXBCF_CF20              (0x1u << CAN_TXBCF_CF20_Pos)
#define CAN_TXBCF_CF21_Pos          21           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 21 */
#define CAN_TXBCF_CF21              (0x1u << CAN_TXBCF_CF21_Pos)
#define CAN_TXBCF_CF22_Pos          22           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 22 */
#define CAN_TXBCF_CF22              (0x1u << CAN_TXBCF_CF22_Pos)
#define CAN_TXBCF_CF23_Pos          23           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 23 */
#define CAN_TXBCF_CF23              (0x1u << CAN_TXBCF_CF23_Pos)
#define CAN_TXBCF_CF24_Pos          24           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 24 */
#define CAN_TXBCF_CF24              (0x1u << CAN_TXBCF_CF24_Pos)
#define CAN_TXBCF_CF25_Pos          25           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 25 */
#define CAN_TXBCF_CF25              (0x1u << CAN_TXBCF_CF25_Pos)
#define CAN_TXBCF_CF26_Pos          26           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 26 */
#define CAN_TXBCF_CF26              (0x1u << CAN_TXBCF_CF26_Pos)
#define CAN_TXBCF_CF27_Pos          27           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 27 */
#define CAN_TXBCF_CF27              (0x1u << CAN_TXBCF_CF27_Pos)
#define CAN_TXBCF_CF28_Pos          28           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 28 */
#define CAN_TXBCF_CF28              (0x1u << CAN_TXBCF_CF28_Pos)
#define CAN_TXBCF_CF29_Pos          29           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 29 */
#define CAN_TXBCF_CF29              (0x1u << CAN_TXBCF_CF29_Pos)
#define CAN_TXBCF_CF30_Pos          30           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 30 */
#define CAN_TXBCF_CF30              (0x1u << CAN_TXBCF_CF30_Pos)
#define CAN_TXBCF_CF31_Pos          31           /**< \brief (CAN_TXBCF) Tx Buffer Cancellation Finished 31 */
#define CAN_TXBCF_CF31              (0x1u << CAN_TXBCF_CF31_Pos)
#define CAN_TXBCF_MASK              0xFFFFFFFFu  /**< \brief (CAN_TXBCF) MASK Register */

/* -------- CAN_TXBTIE : (CAN Offset: 0xE0) (R/W 32) Tx Buffer Transmission Interrupt Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t TIE0: 1;          /*!< bit:      0  Transmission Interrupt Enable 0    */
        uint32_t TIE1: 1;          /*!< bit:      1  Transmission Interrupt Enable 1    */
        uint32_t TIE2: 1;          /*!< bit:      2  Transmission Interrupt Enable 2    */
        uint32_t TIE3: 1;          /*!< bit:      3  Transmission Interrupt Enable 3    */
        uint32_t TIE4: 1;          /*!< bit:      4  Transmission Interrupt Enable 4    */
        uint32_t TIE5: 1;          /*!< bit:      5  Transmission Interrupt Enable 5    */
        uint32_t TIE6: 1;          /*!< bit:      6  Transmission Interrupt Enable 6    */
        uint32_t TIE7: 1;          /*!< bit:      7  Transmission Interrupt Enable 7    */
        uint32_t TIE8: 1;          /*!< bit:      8  Transmission Interrupt Enable 8    */
        uint32_t TIE9: 1;          /*!< bit:      9  Transmission Interrupt Enable 9    */
        uint32_t TIE10: 1;         /*!< bit:     10  Transmission Interrupt Enable 10   */
        uint32_t TIE11: 1;         /*!< bit:     11  Transmission Interrupt Enable 11   */
        uint32_t TIE12: 1;         /*!< bit:     12  Transmission Interrupt Enable 12   */
        uint32_t TIE13: 1;         /*!< bit:     13  Transmission Interrupt Enable 13   */
        uint32_t TIE14: 1;         /*!< bit:     14  Transmission Interrupt Enable 14   */
        uint32_t TIE15: 1;         /*!< bit:     15  Transmission Interrupt Enable 15   */
        uint32_t TIE16: 1;         /*!< bit:     16  Transmission Interrupt Enable 16   */
        uint32_t TIE17: 1;         /*!< bit:     17  Transmission Interrupt Enable 17   */
        uint32_t TIE18: 1;         /*!< bit:     18  Transmission Interrupt Enable 18   */
        uint32_t TIE19: 1;         /*!< bit:     19  Transmission Interrupt Enable 19   */
        uint32_t TIE20: 1;         /*!< bit:     20  Transmission Interrupt Enable 20   */
        uint32_t TIE21: 1;         /*!< bit:     21  Transmission Interrupt Enable 21   */
        uint32_t TIE22: 1;         /*!< bit:     22  Transmission Interrupt Enable 22   */
        uint32_t TIE23: 1;         /*!< bit:     23  Transmission Interrupt Enable 23   */
        uint32_t TIE24: 1;         /*!< bit:     24  Transmission Interrupt Enable 24   */
        uint32_t TIE25: 1;         /*!< bit:     25  Transmission Interrupt Enable 25   */
        uint32_t TIE26: 1;         /*!< bit:     26  Transmission Interrupt Enable 26   */
        uint32_t TIE27: 1;         /*!< bit:     27  Transmission Interrupt Enable 27   */
        uint32_t TIE28: 1;         /*!< bit:     28  Transmission Interrupt Enable 28   */
        uint32_t TIE29: 1;         /*!< bit:     29  Transmission Interrupt Enable 29   */
        uint32_t TIE30: 1;         /*!< bit:     30  Transmission Interrupt Enable 30   */
        uint32_t TIE31: 1;         /*!< bit:     31  Transmission Interrupt Enable 31   */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} CAN_TXBTIE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CAN_TXBTIE_OFFSET           0xE0         /**< \brief (CAN_TXBTIE offset) Tx Buffer Transmission Interrupt Enable */
#define CAN_TXBTIE_RESETVALUE       0x00000000u  /**< \brief (CAN_TXBTIE reset_value) Tx Buffer Transmission Interrupt Enable */

