BitBoxSwiss/bitbox02-firmware/external/samd51a-ds/include/component/can.h
/** \brief CAN Mram_txbe hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
    __IO CAN_TXBE_0_Type
    TXBE_0;      /**< \brief Offset: 0x00 (R/W 32) Tx Buffer Element 0 */
    __IO CAN_TXBE_1_Type
    TXBE_1;      /**< \brief Offset: 0x04 (R/W 32) Tx Buffer Element 1 */
    __IO CAN_TXBE_DATA_Type
    TXBE_DATA[16]; /**< \brief Offset: 0x08 (R/W 32) Tx Buffer Element Data */
} CanMramTxbe
#ifdef __GNUC__
__attribute__ ((aligned (4)))
#endif
;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief CAN Mram_txefe hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
    __IO CAN_TXEFE_0_Type
    TXEFE_0;     /**< \brief Offset: 0x00 (R/W 32) Tx Event FIFO Element 0 */
    __IO CAN_TXEFE_1_Type
    TXEFE_1;     /**< \brief Offset: 0x04 (R/W 32) Tx Event FIFO Element 1 */
} CanMramTxefe
#ifdef __GNUC__
__attribute__ ((aligned (4)))
#endif
;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief CAN Mram_xifde hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
    __IO CAN_XIDFE_0_Type
    XIDFE_0;     /**< \brief Offset: 0x00 (R/W 32) Extended Message ID Filter Element 0 */
    __IO CAN_XIDFE_1_Type
    XIDFE_1;     /**< \brief Offset: 0x04 (R/W 32) Extended Message ID Filter Element 1 */
} CanMramXifde
#ifdef __GNUC__
__attribute__ ((aligned (4)))
#endif
;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SECTION_CAN_MRAM_RXBE

#define SECTION_CAN_MRAM_RXF0E

#define SECTION_CAN_MRAM_RXF1E

#define SECTION_CAN_MRAM_SIDFE

#define SECTION_CAN_MRAM_TXBE

#define SECTION_CAN_MRAM_TXEFE

#define SECTION_CAN_MRAM_XIFDE

/*@}*/

#endif /* _SAMD51_CAN_COMPONENT_ */
